tutorials/multiphaseReactiveTransport/interReactiveTransferFoam/2DCavity/system/blockMeshDict2D
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (0          0     0) //0
    (lx1     0     0) //1
    (lx1     ly1     0) //2
    (0          ly1     0) //3
    (0          0     lz) //4
    (lx1     0     lz ) //5
    (lx1     ly1     lz ) //6
    (0          ly1     lz ) //7

 

    (lx2     0     0) //8
    (lx2     ly1    0) //9
    (lx2     0     lz ) //10
    (lx2     ly1     lz ) //11

 

    (lx1    ly2     0) //12
    (lx2     ly2     0) //13
    (lx1     ly2     lz ) //14
    (lx2     ly2     lz ) //15

 

    (lx3     0     0) //16
    (lx3     ly1    0) //17
    (lx3     0     lz) //18
    (lx3     ly1     lz) //19
);

 

blocks
(
    hex (0 1 2 3 4 5 6 7)    (nx1 ny1 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6)     (nx2 ny1 1) simpleGrading (1 1 1)
    hex (12 13 8 1 14 15 10 5)     (nx2 ny2 1) simpleGrading (1 1 1)
    hex (8 16 17 9 10 18 19 11) (nx3 ny1 1) simpleGrading (1 1 1)
);

 

edges();

 

boundary
(
    right
    {
        type patch;
        faces
        (
          (18 16 17 19)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    top
    {
        type wall;
        faces
        (
            (7 6 2 3)
        (6 11 9 2)
        (11 19 17 9)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (14 15 13 12)
        (14 12 1 5)
        (15 13 8 10)
        (10 18 16 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        (5 10 11 6)
        (1 8 9 2)
        (12 13 8 1)
        (14 15 10 5)
        (8 16 17 9)
        (10 18 19 11)
        );
    }
);

 

mergePatchPairs();

 

// ************************************************************************* //
 
